# -*- coding: utf-8 -*-
"""Лабораторная 3.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1jaI31Qp7WBDQrkCqej5YL8Ydv3nPiDhc
"""

# Лабораторная № 3

# Задание № 1

n = int(input())

if n == 1:
  print('Январь')
if n == 2:
  print('Февраль')
if n == 3:
  print('Март')
if n == 4:
  print('Апрель')
if n == 5:
  print('Май')
if n == 6:
  print('Июнь')
if n == 7:
  print('Июль')
if n == 8:
  print('Август')
if n == 9:
  print('Сентябрь')
if n == 10:
  print('Октябрь')
if n == 11:
  print('Ноябрь')
if n == 12:
  print('Декабрь')

# Задание № 2

n = int(input())

if n % 2 == 0:
  print('Чётное')
else:
  print('Нечётное')

# Задание № 3

n = int(input())
if n > 40:
  print('stonks')
else:
  print('not stonks')

# Задание № 4

def is_year_leap(n):
  if n % 4:
    if n % 100:
      if n % 400:
        return True
      else:
        return False
    else:
      return True
  else:
    return False

n = int(input())
is_year_leap(n)

# Задание № 5

def is_prime(n):
  if n == 1:
    s = 'Не является ни простым, ни составным числом'
    return s
  if n == 2:
    return True
  else:
    c = 2
    for i in range(2, n + 1):
      if n % i == 0:
        c += 1
    if c == 2:
      return True
    else:
      return False

n = int(input())
is_prime(n)

# Задание № 6

a, b = float(input()), float(input())

m = (-138 / 2) ** 1.3
n = abs((-69 / 28 ** 5.1) * 4)

# Проверяем, является ли m комплексным числом:
if isinstance(m, complex):
# Если да, то пропускаем проверку range, так как число b принадлежит типу float
  if a / b == 3.6:
    a, b = b, a
else:
# Иначе, делаем полную проверку, включая наличие числа b в заданном диапазоне:
  if a / b == 3.6 or b >= m and b <= n:
    a, b = b, a

print(a, b)

# Задание № 7

n1, n2, n3, n4, n5 = float(input()), float(input()), float(input()), float(input()), float(input())
set1 = set()
set1.add(n1)
set1.add(n2)
set1.add(n3)
set1.add(n4)
set1.add(n5)
list1 = list(int(i) for i in range(-256, 1024 + 1))

if len(set1) == 5:
  print('Все числа явлются уникальными')

  count_chet = 0
  count_negative = 0
  count_p = 0

  for chislo in set1:

    if chislo % 2 == 0:
      count_chet += 1

    if chislo < 0:
      count_negative += 1

    if chislo in list1:
      count_p += 1

  if count_chet == 5:
    print('Все числа чётные')
  else:
    print(f'Не все числа чётные, а только {count_chet}')

  if count_negative == 5:
    print('Все числа отрицательные')
  else:
    print(f'Не все числа отрицательные, а только {count_negative}')

  if count_p == 5:
    print('Все числа находятся в заданном промежутке')
  else:
    print(f'Не все числа находлятся в заданном промежутке, а только {count_p}')

else:
  print('Не все числа уникальные')

# Задание повышенной сложности

a = float(input())
b = float(input())
c = float(input())

res = (a ** 2 + b ** 3) / (4 * (c + 3))
if res % 2 == 0:
  print('Число чётное')
else:
  print('Число нечётное')